modus_app_api/app/controllers/users_controller.rb

  def create
    puts 'HELLO PEOPLE OF EARTH'
    puts params
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "a"], ["password_digest", "$2a$10$4qOgpIAVtfjQMG4..ce95uUlDFSja3oezAj6llAH8YH.Qk0IvxyHy"], ["created_at", "2017-09-11 20:42:35.747726"], ["updated_at", "2017-09-11 20:42:35.747726"]]